Autodesk.Revit.DB.Analysis.IPathOfTravelCalculationServer.Calculate(Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData)
Calculate the path of travel.
Since:
2020

Autodesk.Revit.DB.Analysis.IPathOfTravelCalculationServer
Interface class for external servers implementing Path of travel calculations.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.
Since:
2020